#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.database_password: Refreshing state... [id=none]
random_password.staging_db_password: Refreshing state... [id=none]
google_project_service.secretmanager: Refreshing state... [id=venture-capitol/secretmanager.googleapis.com]
google_project_service.iam: Refreshing state... [id=venture-capitol/iam.googleapis.com]
google_project_service.run: Refreshing state... [id=venture-capitol/run.googleapis.com]
google_project_service.sql: Refreshing state... [id=venture-capitol/sqladmin.googleapis.com]
google_sql_database_instance.vc_db: Refreshing state... [id=vc-backend-database]
google_secret_manager_secret.staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/staging_db_connection_string]
google_service_account.backend_sa: Refreshing state... [id=projects/venture-capitol/serviceAccounts/backend-sa@venture-capitol.iam.gserviceaccount.com]
google_secret_manager_secret.db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string]
google_secret_manager_secret_version.db_connection_string_data: Refreshing state... [id=projects/122736358705/secrets/db_connection_string/versions/1]
google_sql_database.backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/backend]
google_sql_user.database_user: Refreshing state... [id=backend_user//vc-backend-database]
google_secret_manager_secret_version.staging_db_connection_string: Refreshing state... [id=projects/122736358705/secrets/staging_db_connection_string/versions/1]
google_sql_database.staging_backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/staging_backend]
google_sql_user.staging_database_user: Refreshing state... [id=staging_backend_user//vc-backend-database]
google_secret_manager_secret_iam_binding.staging_db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/staging_db_connection_string/roles/secretmanager.secretAccessor]
google_secret_manager_secret_iam_binding.db_connection_string_access: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string/roles/secretmanager.secretAccessor]
google_project_iam_binding.service_permissions["cloudsql.client"]: Refreshing state... [id=venture-capitol/roles/cloudsql.client]
google_project_iam_binding.service_permissions["run.admin"]: Refreshing state... [id=venture-capitol/roles/run.admin]
google_cloud_run_service.backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend]
google_cloud_run_service.staging_backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/venture-capitol/locations/europe-west1/services/vc-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_domain_mapping.root will be created
  + resource "google_cloud_run_domain_mapping" "root" {
      + id       = (known after apply)
      + location = "europe-west1"
      + name     = "api.venturecapitol.de"
      + project  = (known after apply)
      + status   = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = "venture-capitol"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "vc-backend"
        }
    }

  # google_cloud_run_domain_mapping.staging will be created
  + resource "google_cloud_run_domain_mapping" "staging" {
      + id       = (known after apply)
      + location = "europe-west1"
      + name     = "staging.api.venturecapitol.de"
      + project  = (known after apply)
      + status   = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = "venture-capitol"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "vc-backend-staging"
        }
    }

  # google_cloud_run_service.backend will be updated in-place
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend"
        name                       = "vc-backend"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:da6bf8" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:582595"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.staging_backend will be updated in-place
  ~ resource "google_cloud_run_service" "staging_backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend-staging"
        name                       = "vc-backend-staging"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:da6bf8" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:582595"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>